# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [4]:
import pandas as pd
import numpy as np

In [5]:
from numpy.random import randn
np.random.seed(101)

In [6]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [7]:
randn(4, 4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651]])

In [10]:
df = pd.DataFrame(randn(4, 4), 
                  index=["Petya", "Magnum", "Zvetochki", "Chtoto"], 
                  columns=["A", "B", "C", "D"])

In [19]:
df

                  A         B         C         D
Petya     -0.497104 -0.754070 -0.943406  0.484752
Magnum    -0.116773  1.901755  0.238127  1.996652
Zvetochki -0.993263  0.196800 -1.136645  0.000366
Chtoto     1.025984 -0.156598 -0.031579  0.649826

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [16]:
df['B']

Petya       -0.754070
Magnum       1.901755
Zvetochki    0.196800
Chtoto      -0.156598
Name: B, dtype: float64

In [26]:
# Pass a list of column names
df[['A','B']]

                  A         B
Petya     -0.497104 -0.754070
Magnum    -0.116773  1.901755
Zvetochki -0.993263  0.196800
Chtoto     1.025984 -0.156598

In [27]:
# SQL Syntax (NOT RECOMMENDED!)
df.A

Petya       -0.497104
Magnum      -0.116773
Zvetochki   -0.993263
Chtoto       1.025984
Name: A, dtype: float64

DataFrame Columns are just Series

In [21]:
type(df['A'])

pandas.core.series.Series

**Creating a new column:**

In [36]:
df['new'] = df['A'] + df['B']
df['new2'] = [1,2,3,4]
df['new3'] = [None, None, None, None]

In [37]:
df

                  A         B         C         D       new  new2  new3
Petya     -0.497104 -0.754070 -0.943406  0.484752 -1.251174     1  None
Magnum    -0.116773  1.901755  0.238127  1.996652  1.784981     2  None
Zvetochki -0.993263  0.196800 -1.136645  0.000366 -0.796464     3  None
Chtoto     1.025984 -0.156598 -0.031579  0.649826  0.869386     4  None

** Removing Columns**

In [57]:
df.drop('C', axis=1)
# df.drop('B', axis=1, inplace=True)

                  D       new  new2  new3
Petya      0.484752 -1.251174     1  None
Magnum     1.996652  1.784981     2  None
Zvetochki  0.000366 -0.796464     3  None
Chtoto     0.649826  0.869386     4  None

In [50]:
# Not inplace unless specified!
df

                  C         D       new  new2  new3
Petya     -0.943406  0.484752 -1.251174     1  None
Magnum     0.238127  1.996652  1.784981     2  None
Zvetochki -1.136645  0.000366 -0.796464     3  None
Chtoto    -0.031579  0.649826  0.869386     4  None

In [70]:
df.drop('new', axis=1, inplace=True)

In [71]:
df

          W         X         Y         Z
C  0.651118 -0.319318 -0.848077  0.605965
D -2.018168  0.740122  0.528813 -0.589001
E  0.188695 -0.758872 -0.933237  0.955057

Can also drop rows this way:

In [61]:
df.drop('Chtoto', axis=0)

                  C         D       new  new2  new3
Petya     -0.943406  0.484752 -1.251174     1  None
Magnum     0.238127  1.996652  1.784981     2  None
Zvetochki -1.136645  0.000366 -0.796464     3  None

** Selecting Rows**

In [68]:
# df['D'] # Column
df.loc['Petya'] # Row

C      -0.943406
D       0.484752
new     -1.25117
new2           1
new3        None
Name: Petya, dtype: object

Or select based off of position instead of label

In [71]:
df.iloc[0]

C      -0.943406
D       0.484752
new     -1.25117
new2           1
new3        None
Name: Petya, dtype: object

** Selecting subset of rows and columns **

In [76]:
df.loc[['Magnum', 'Petya'], ['C', 'D']]

               C         D
Magnum  0.238127  1.996652
Petya  -0.943406  0.484752

In [83]:
a = [1, 2, 3, 4, 5, 6, 7, 8, 9]
a[-3:]

[7, 8, 9]

In [74]:
df

                  A         B         C         D       new  new2  new3
Petya      2.154846 -0.610259 -0.755325 -0.346419  1.544588     1  None
Magnum     0.147027 -0.479448  0.558769  1.024810 -0.332421     2  None
Zvetochki -0.925874  1.862864 -1.133817  0.610478  0.936990     3  None

In [94]:
# df.loc[['A','B'], ['W','Y']]
df.iloc[1:3, -3:]
df.iloc[1:, [0, 1, 2]]
df.iloc[1:, :3]

                  C         D       new
Magnum     0.238127  1.996652  1.784981
Zvetochki -1.136645  0.000366 -0.796464
Chtoto    -0.031579  0.649826  0.869386

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [101]:
df

                  C         D       new  new2  new3
Petya     -0.943406  0.484752 -1.251174     1  None
Magnum     0.238127  1.996652  1.784981     2  None
Zvetochki -1.136645  0.000366 -0.796464     3  None
Chtoto    -0.031579  0.649826  0.869386     4  None

In [102]:
df > 0

               C     D    new  new2   new3
Petya      False  True  False  True  False
Magnum      True  True   True  True  False
Zvetochki  False  True  False  True  False
Chtoto     False  True   True  True  False

In [103]:
df[df>0]

                  C         D       new  new2 new3
Petya           NaN  0.484752       NaN     1  NaN
Magnum     0.238127  1.996652  1.784981     2  NaN
Zvetochki       NaN  0.000366       NaN     3  NaN
Chtoto          NaN  0.649826  0.869386     4  NaN

In [109]:
df[df['C'] > 0]

               C         D       new  new2  new3
Magnum  0.238127  1.996652  1.784981     2  None

In [102]:
df[df['A']>0]

               A         B         C         D       new  new2  new3
Petya   2.154846 -0.610259 -0.755325 -0.346419  1.544588     1  None
Magnum  0.147027 -0.479448  0.558769  1.024810 -0.332421     2  None

In [113]:
df[df['C']>0][['C','D']]

               C         D
Magnum  0.238127  1.996652

For two conditions you can use | and & with parenthesis:

In [119]:
# df[(df['C']>0) & (df['D'] > 0)]
df[df['C']>0][df['D']>0]

C:\Users\KindYAK\Anaconda3\envs\def\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

               C         D       new  new2  new3
Magnum  0.238127  1.996652  1.784981     2  None

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [131]:
df

                  C         D       new  new2  new3  index
Petya     -0.943406  0.484752 -1.251174     1  None      1
Magnum     0.238127  1.996652  1.784981     2  None      2
Zvetochki -1.136645  0.000366 -0.796464     3  None      3
Chtoto    -0.031579  0.649826  0.869386     4  None      4

In [141]:
# Reset to default 0,1...n index
df.reset_index(inplace=True)

In [142]:
df

     level_0         C         D       new  new2  new3  index       Shops
0      Petya -0.943406  0.484752 -1.251174     1  None      1      Shop 1
1     Magnum  0.238127  1.996652  1.784981     2  None      2      Shop 2
2  Zvetochki -1.136645  0.000366 -0.796464     3  None      3  Shop gfhfg
3     Chtoto -0.031579  0.649826  0.869386     4  None      4        asfd

In [134]:
df['Shops'] = ['Shop 1', 'Shop 2', 'Shop gfhfg', "asfd"]

In [135]:
df

                  C         D       new  new2  new3  index       Shops
Petya     -0.943406  0.484752 -1.251174     1  None      1      Shop 1
Magnum     0.238127  1.996652  1.784981     2  None      2      Shop 2
Zvetochki -1.136645  0.000366 -0.796464     3  None      3  Shop gfhfg
Chtoto    -0.031579  0.649826  0.869386     4  None      4        asfd

In [138]:
df.set_index('Shops')

                   C         D       new  new2  new3  index
Shops
Shop 1     -0.943406  0.484752 -1.251174     1  None      1
Shop 2      0.238127  1.996652  1.784981     2  None      2
Shop gfhfg -1.136645  0.000366 -0.796464     3  None      3
asfd       -0.031579  0.649826  0.869386     4  None      4

In [95]:
df

          W         X         Y         Z States
C  0.651118 -0.319318 -0.848077  0.605965     CA
D -2.018168  0.740122  0.528813 -0.589001     NY
E  0.188695 -0.758872 -0.933237  0.955057     CA

In [96]:
df.set_index('States', inplace=True)

In [97]:
df

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
CA      0.188695 -0.758872 -0.933237  0.955057

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [144]:
list(zip(outside,inside))

NameError: name 'outside' is not defined

In [147]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [148]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [150]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1 -1.382920  1.482495
   2  0.961458 -2.141212
   3  0.992573  1.192241
G2 1 -1.046780  1.292765
   2 -1.467514 -0.494095
   3 -0.162535  0.485809

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [161]:
df.loc['G1']

          A         B
1  0.041460 -0.411055
2 -0.771329  0.110477
3 -0.804652  0.253548

In [152]:
df.loc['G1'].loc[1]

A   -1.382920
B    1.482495
Name: 1, dtype: float64

In [167]:
df.index.names = ['Shop','Cassa']

In [168]:
df

                   A         B
Shop Cassa
G1   1      0.041460 -0.411055
     2     -0.771329  0.110477
     3     -0.804652  0.253548
G2   1      0.649148  0.358941
     2     -1.080471  0.902398
     3      0.161781  0.833029

In [171]:
df.xs('G2')

              A         B
Cassa
1      0.649148  0.358941
2     -1.080471  0.902398
3      0.161781  0.833029

In [55]:
df.xs(['G1',1])

A    0.190794
B    1.978757
Name: (G1, 1), dtype: float64

In [173]:
df.xs(1, level='Cassa')

             A         B
Shop
G1    0.041460 -0.411055
G2    0.649148  0.358941

# Great Job!